# DataFrame

## What is DataFrame?

In [1]:
import pandas as pd

In [2]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [5]:
df=pd.DataFrame(data,columns=["name","sport","sex","score"])
df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

----

### Checking the first or last several lines $\Rightarrow$ `.head()` `.tail()`

In [6]:
df.head()

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80
2   Tim     Skiing   M     85
3  John   Swimming   M     75
4  Alex     Tennis   F     95

In [7]:
df.tail()

      name     sport sex  score
2      Tim    Skiing   M     85
3     John  Swimming   M     75
4     Alex    Tennis   F     95
5  Vanessa    Karete   F     60
6     Kate   Surfing   F     65

In [8]:
df.tail(3)

      name    sport sex  score
4     Alex   Tennis   F     95
5  Vanessa   Karete   F     60
6     Kate  Surfing   F     65

In [9]:
df.head(2)

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80

In [10]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"])
df

      name      sport gender  score  age
0     Bill  Wrestling    NaN     90  NaN
1      Tom   Football    NaN     80  NaN
2      Tim     Skiing    NaN     85  NaN
3     John   Swimming    NaN     75  NaN
4     Alex     Tennis    NaN     95  NaN
5  Vanessa     Karete    NaN     60  NaN
6     Kate    Surfing    NaN     65  NaN

In [29]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90  NaN
two        Tom   Football    NaN     80  NaN
three      Tim     Skiing    NaN     85  NaN
four      John   Swimming    NaN     75  NaN
five      Alex     Tennis    NaN     95  NaN
six    Vanessa     Karete    NaN     60  NaN
seven     Kate    Surfing    NaN     65  NaN

In [30]:
df["sport"]

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [41]:
my_columns=["name","sport"]
df[my_columns]

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [42]:
df.sport

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [43]:
df.loc[["one"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90   18

In [44]:
df.loc[["one","two"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90   18
two   Tom   Football    NaN     80   19

In [45]:
df["age"]=18

In [46]:
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   18
three      Tim     Skiing    NaN     85   18
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   18
six    Vanessa     Karete    NaN     60   18
seven     Kate    Surfing    NaN     65   18

In [47]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])
values=[18,19,20,18,17,17,18]
df["age"]=values
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [48]:
df["pass"]=df.score>=70
df

          name      sport gender  score  age   pass
one       Bill  Wrestling    NaN     90   18   True
two        Tom   Football    NaN     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [49]:
del df["pass"]
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

### Dropping more than one columns

In [50]:
df.drop(['name','sport','gender'], axis = 1)

       score  age
one       90   18
two       80   19
three     85   20
four      75   18
five      95   17
six       60   17
seven     65   18

---

### Renaming Columns

In [51]:
df.rename(columns = {'name':'name2'})

         name2      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

### Arithematic / String Operations between columns

In [53]:
df['name'] + ' ' + df['sport']

one      Bill Wrestling
two        Tom Football
three        Tim Skiing
four      John Swimming
five        Alex Tennis
six      Vanessa Karete
seven      Kate Surfing
dtype: object

In [54]:
df['score']*3

one      270
two      240
three    255
four     225
five     285
six      180
seven    195
Name: score, dtype: int64

In [55]:
df['score times 3'] = df.score *3

In [56]:
df

          name      sport gender  score  age  score times 3
one       Bill  Wrestling    NaN     90   18            270
two        Tom   Football    NaN     80   19            240
three      Tim     Skiing    NaN     85   20            255
four      John   Swimming    NaN     75   18            225
five      Alex     Tennis    NaN     95   17            285
six    Vanessa     Karete    NaN     60   17            180
seven     Kate    Surfing    NaN     65   18            195

---

### `.apply()` for pandas Series obj

#### Example without apply

In [59]:
def checking_age(age):
    if age > 18:
        return True
    else:
        return False

In [61]:
# list comprehension with the function checking_age
[checking_age(x) for x in df.age]

[False, True, True, False, False, False, False]

In [62]:
# list comprehension with if else statement
[True if x > 18 else False for x in df.age]

[False, True, True, False, False, False, False]

#### Using .apply()

In [63]:
df.age.apply(checking_age)

one      False
two       True
three     True
four     False
five     False
six      False
seven    False
Name: age, dtype: bool

In [64]:
df.age.apply(lambda x: True if x > 18 else False)

one      False
two       True
three     True
four     False
five     False
six      False
seven    False
Name: age, dtype: bool

---

### `.apply()` for pandas DataFrame obj

When `axis = 0`: column-wise operation

In [71]:
df

          name      sport gender  score  age  score times 3
one       Bill  Wrestling    NaN     90   18            270
two        Tom   Football    NaN     80   19            240
three      Tim     Skiing    NaN     85   20            255
four      John   Swimming    NaN     75   18            225
five      Alex     Tennis    NaN     95   17            285
six    Vanessa     Karete    NaN     60   17            180
seven     Kate    Surfing    NaN     65   18            195

In [72]:
df[['score','age']].apply(sum, axis = 0)

score    550
age      127
dtype: int64

In [81]:
import numpy as np
def max_minus_mean_div_sd(vec):
    mean = np.mean(vec)
    M = max(vec)
    sd = np.std(vec)
    return (M-mean)/sd

In [82]:
df[['score','age']].apply(max_minus_mean_div_sd, axis = 0)

score    1.384437
age      1.876388
dtype: float64

---

**When `axis = 1`: row-wise operation**

In [84]:
df.apply(lambda x: x.name + ' ' + x.sport, axis = 1)

one      one Wrestling
two       two Football
three     three Skiing
four     four Swimming
five       five Tennis
six         six Karete
seven    seven Surfing
dtype: object

In [85]:
df.apply(lambda x: True if x.age > 18 else False, axis = 1)

one      False
two       True
three     True
four     False
five     False
six      False
seven    False
dtype: bool